virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/atsamg55j19.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/*
 * \brief Configuration of the CORTEX-M4 Processor and Core Peripherals
 */
#define __CM4_REV                 0x0001 /**< CM4 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4 /**< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0 /**< Set to 1 if different SysTick Config is used                              */
#define __MPU_PRESENT                  1 /**< MPU present or not                                                        */
#define __VTOR_PRESENT                 1 /**< Vector Table Offset Register present or not                               */
#define __FPU_PRESENT                  1 /**< FPU present or not                                                        */
#define __ARCH_ARM                     1
#define __ARCH_ARM_CORTEX_M            1
#define __DEVICE_IS_SAM                1

/*
 * \brief CMSIS includes
 */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
#include "system_samg55.h"
#endif /* USE_CMSIS_INIT */

/** \defgroup SAMG55J19_api Peripheral Software API
 *  @{
 */

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAMG55J19                         */
/* ************************************************************************** */
#include "component/adc.h"
#include "component/chipid.h"
#include "component/cmcc.h"
#include "component/crccu.h"
#include "component/efc.h"
#include "component/flexcom.h"
#include "component/gpbr.h"
#include "component/i2sc.h"
#include "component/matrix.h"
#include "component/mem2mem.h"
#include "component/pdc.h"
#include "component/pdmic.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/spi.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/twi.h"
#include "component/udp.h"
#include "component/uhp.h"
#include "component/usart.h"
#include "component/wdt.h"
/** @}  end of Peripheral Software API */

/** \addtogroup SAMG55J19_id Peripheral Ids Definitions
 *  @{
 */

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR SAMG55J19                                   */
/* ************************************************************************** */
#define ID_SUPC          (  0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC          (  1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC           (  2) /**< \brief Real-time Clock (RTC) */
#define ID_RTT           (  3) /**< \brief Real-time Timer (RTT) */
#define ID_WDT           (  4) /**< \brief Watchdog Timer (WDT) */
#define ID_PMC           (  5) /**< \brief Power Management Controller (PMC) */
#define ID_EFC           (  6) /**< \brief Embedded Flash Controller (EFC) */
#define ID_FLEXCOM7      (  7) /**< \brief Flexible Serial Communication (FLEXCOM7) */
#define ID_FLEXCOM0      (  8) /**< \brief Flexible Serial Communication (FLEXCOM0) */
#define ID_FLEXCOM1      (  9) /**< \brief Flexible Serial Communication (FLEXCOM1) */
#define ID_PIOA          ( 11) /**< \brief Parallel Input/Output Controller (PIOA) */
#define ID_PIOB          ( 12) /**< \brief Parallel Input/Output Controller (PIOB) */
#define ID_PDMIC0        ( 13) /**< \brief Pulse Density Modulation Interface Controller (PDMIC0) */
#define ID_FLEXCOM2      ( 14) /**< \brief Flexible Serial Communication (FLEXCOM2) */
#define ID_MEM2MEM       ( 15) /**< \brief Memory to Memory (MEM2MEM) */
#define ID_I2SC0         ( 16) /**< \brief Inter-IC Sound Controller (I2SC0) */
#define ID_I2SC1         ( 17) /**< \brief Inter-IC Sound Controller (I2SC1) */
#define ID_PDMIC1        ( 18) /**< \brief Pulse Density Modulation Interface Controller (PDMIC1) */
#define ID_FLEXCOM3      ( 19) /**< \brief Flexible Serial Communication (FLEXCOM3) */
#define ID_FLEXCOM4      ( 20) /**< \brief Flexible Serial Communication (FLEXCOM4) */
#define ID_FLEXCOM5      ( 21) /**< \brief Flexible Serial Communication (FLEXCOM5) */
#define ID_FLEXCOM6      ( 22) /**< \brief Flexible Serial Communication (FLEXCOM6) */
#define ID_TC0_CHANNEL0  ( 23) /**< \brief Timer Counter (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1  ( 24) /**< \brief Timer Counter (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2  ( 25) /**< \brief Timer Counter (TC0_CHANNEL2) */
#define ID_TC1_CHANNEL0  ( 26) /**< \brief Timer Counter (TC1_CHANNEL0) */
#define ID_TC1_CHANNEL1  ( 27) /**< \brief Timer Counter (TC1_CHANNEL1) */
#define ID_TC1_CHANNEL2  ( 28) /**< \brief Timer Counter (TC1_CHANNEL2) */
#define ID_ADC           ( 29) /**< \brief Analog-to-Digital Converter (ADC) */
#define ID_UHP           ( 47) /**< \brief USB Host Port (UHP) */
#define ID_UDP           ( 48) /**< \brief USB Device Port (UDP) */
#define ID_CRCCU         ( 49) /**< \brief Cyclic Redundancy Check Calculation Unit (CRCCU) */

#define ID_PERIPH_MAX    ( 49) /**< \brief Number of peripheral IDs */
/** @}  end of Peripheral Ids Definitions */

/** \addtogroup SAMG55J19_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR SAMG55J19                     */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ADC_REGS                         ((adc_registers_t*)0x40038000)                /**< \brief ADC Registers Address        */
#define CHIPID_REGS                      ((chipid_registers_t*)0x400e0740)             /**< \brief CHIPID Registers Address     */
#define CMCC_REGS                        ((cmcc_registers_t*)0x4003c000)               /**< \brief CMCC Registers Address       */
#define CRCCU_REGS                       ((crccu_registers_t*)0x40048000)              /**< \brief CRCCU Registers Address      */
#define EFC_REGS                         ((efc_registers_t*)0x400e0a00)                /**< \brief EFC Registers Address        */
#define FLEXCOM0_REGS                    ((flexcom_registers_t*)0x4000c000)            /**< \brief FLEXCOM0 Registers Address   */
#define FLEXCOM1_REGS                    ((flexcom_registers_t*)0x40020000)            /**< \brief FLEXCOM1 Registers Address   */
#define FLEXCOM2_REGS                    ((flexcom_registers_t*)0x40024000)            /**< \brief FLEXCOM2 Registers Address   */
#define FLEXCOM3_REGS                    ((flexcom_registers_t*)0x40018000)            /**< \brief FLEXCOM3 Registers Address   */
#define FLEXCOM4_REGS                    ((flexcom_registers_t*)0x4001c000)            /**< \brief FLEXCOM4 Registers Address   */
#define FLEXCOM5_REGS                    ((flexcom_registers_t*)0x40008000)            /**< \brief FLEXCOM5 Registers Address   */
#define FLEXCOM6_REGS                    ((flexcom_registers_t*)0x40040000)            /**< \brief FLEXCOM6 Registers Address   */
#define FLEXCOM7_REGS                    ((flexcom_registers_t*)0x40034000)            /**< \brief FLEXCOM7 Registers Address   */
#define GPBR_REGS                        ((gpbr_registers_t*)0x400e1490)               /**< \brief GPBR Registers Address       */
#define I2SC0_REGS                       ((i2sc_registers_t*)0x40000000)               /**< \brief I2SC0 Registers Address      */
#define I2SC1_REGS                       ((i2sc_registers_t*)0x40004000)               /**< \brief I2SC1 Registers Address      */
#define MATRIX_REGS                      ((matrix_registers_t*)0x400e0200)             /**< \brief MATRIX Registers Address     */
#define MEM2MEM_REGS                     ((mem2mem_registers_t*)0x40028000)            /**< \brief MEM2MEM Registers Address    */
#define PDMIC0_REGS                      ((pdmic_registers_t*)0x4002c000)              /**< \brief PDMIC0 Registers Address     */
#define PDMIC1_REGS                      ((pdmic_registers_t*)0x40030000)              /**< \brief PDMIC1 Registers Address     */
#define PIOA_REGS                        ((pio_registers_t*)0x400e0e00)                /**< \brief PIOA Registers Address       */
#define PIOB_REGS                        ((pio_registers_t*)0x400e1000)                /**< \brief PIOB Registers Address       */
#define PMC_REGS                         ((pmc_registers_t*)0x400e0400)                /**< \brief PMC Registers Address        */
#define RSTC_REGS                        ((rstc_registers_t*)0x400e1400)               /**< \brief RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x400e1460)                /**< \brief RTC Registers Address        */
#define RTT_REGS                         ((rtt_registers_t*)0x400e1430)                /**< \brief RTT Registers Address        */
#define SPI0_REGS                        ((spi_registers_t*)0x4000c400)                /**< \brief SPI0 Registers Address       */
#define SPI1_REGS                        ((spi_registers_t*)0x40020400)                /**< \brief SPI1 Registers Address       */
#define SPI2_REGS                        ((spi_registers_t*)0x40024400)                /**< \brief SPI2 Registers Address       */
#define SPI3_REGS                        ((spi_registers_t*)0x40018400)                /**< \brief SPI3 Registers Address       */
#define SPI4_REGS                        ((spi_registers_t*)0x4001c400)                /**< \brief SPI4 Registers Address       */
#define SPI5_REGS                        ((spi_registers_t*)0x40008400)                /**< \brief SPI5 Registers Address       */
#define SPI6_REGS                        ((spi_registers_t*)0x40040400)                /**< \brief SPI6 Registers Address       */
#define SPI7_REGS                        ((spi_registers_t*)0x40034400)                /**< \brief SPI7 Registers Address       */
#define SUPC_REGS                        ((supc_registers_t*)0x400e1410)               /**< \brief SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x40010000)                 /**< \brief TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x40014000)                 /**< \brief TC1 Registers Address        */
#define TWI0_REGS                        ((twi_registers_t*)0x4000c600)                /**< \brief TWI0 Registers Address       */
#define TWI1_REGS                        ((twi_registers_t*)0x40020600)                /**< \brief TWI1 Registers Address       */
#define TWI2_REGS                        ((twi_registers_t*)0x40024600)                /**< \brief TWI2 Registers Address       */
#define TWI3_REGS                        ((twi_registers_t*)0x40018600)                /**< \brief TWI3 Registers Address       */
#define TWI4_REGS                        ((twi_registers_t*)0x4001c600)                /**< \brief TWI4 Registers Address       */
#define TWI5_REGS                        ((twi_registers_t*)0x40008600)                /**< \brief TWI5 Registers Address       */
#define TWI6_REGS                        ((twi_registers_t*)0x40040600)                /**< \brief TWI6 Registers Address       */
#define TWI7_REGS                        ((twi_registers_t*)0x40034600)                /**< \brief TWI7 Registers Address       */
#define UDP_REGS                         ((udp_registers_t*)0x40044000)                /**< \brief UDP Registers Address        */
#define UHP_REGS                         ((uhp_registers_t*)0x4004c000)                /**< \brief UHP Registers Address        */
#define USART0_REGS                      ((usart_registers_t*)0x4000c200)              /**< \brief USART0 Registers Address     */
#define USART1_REGS                      ((usart_registers_t*)0x40020200)              /**< \brief USART1 Registers Address     */
#define USART2_REGS                      ((usart_registers_t*)0x40024200)              /**< \brief USART2 Registers Address     */
#define USART3_REGS                      ((usart_registers_t*)0x40018200)              /**< \brief USART3 Registers Address     */
#define USART4_REGS                      ((usart_registers_t*)0x4001c200)              /**< \brief USART4 Registers Address     */
#define USART5_REGS                      ((usart_registers_t*)0x40008200)              /**< \brief USART5 Registers Address     */
#define USART6_REGS                      ((usart_registers_t*)0x40040200)              /**< \brief USART6 Registers Address     */
#define USART7_REGS                      ((usart_registers_t*)0x40034200)              /**< \brief USART7 Registers Address     */
#define WDT_REGS                         ((wdt_registers_t*)0x400e1450)                /**< \brief WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup SAMG55J19_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAMG55J19                                   */
/* ************************************************************************** */
#define ADC_BASE_ADDRESS                 _UL_(0x40038000)                              /**< \brief ADC Base Address */
#define CHIPID_BASE_ADDRESS              _UL_(0x400e0740)                              /**< \brief CHIPID Base Address */
#define CMCC_BASE_ADDRESS                _UL_(0x4003c000)                              /**< \brief CMCC Base Address */
#define CRCCU_BASE_ADDRESS               _UL_(0x40048000)                              /**< \brief CRCCU Base Address */
#define EFC_BASE_ADDRESS                 _UL_(0x400e0a00)                              /**< \brief EFC Base Address */
#define FLEXCOM0_BASE_ADDRESS            _UL_(0x4000c000)                              /**< \brief FLEXCOM0 Base Address */
#define FLEXCOM1_BASE_ADDRESS            _UL_(0x40020000)                              /**< \brief FLEXCOM1 Base Address */
#define FLEXCOM2_BASE_ADDRESS            _UL_(0x40024000)                              /**< \brief FLEXCOM2 Base Address */
#define FLEXCOM3_BASE_ADDRESS            _UL_(0x40018000)                              /**< \brief FLEXCOM3 Base Address */
#define FLEXCOM4_BASE_ADDRESS            _UL_(0x4001c000)                              /**< \brief FLEXCOM4 Base Address */
#define FLEXCOM5_BASE_ADDRESS            _UL_(0x40008000)                              /**< \brief FLEXCOM5 Base Address */
#define FLEXCOM6_BASE_ADDRESS            _UL_(0x40040000)                              /**< \brief FLEXCOM6 Base Address */
#define FLEXCOM7_BASE_ADDRESS            _UL_(0x40034000)                              /**< \brief FLEXCOM7 Base Address */
#define GPBR_BASE_ADDRESS                _UL_(0x400e1490)                              /**< \brief GPBR Base Address */
#define I2SC0_BASE_ADDRESS               _UL_(0x40000000)                              /**< \brief I2SC0 Base Address */
#define I2SC1_BASE_ADDRESS               _UL_(0x40004000)                              /**< \brief I2SC1 Base Address */
#define MATRIX_BASE_ADDRESS              _UL_(0x400e0200)                              /**< \brief MATRIX Base Address */
#define MEM2MEM_BASE_ADDRESS             _UL_(0x40028000)                              /**< \brief MEM2MEM Base Address */
#define PDMIC0_BASE_ADDRESS              _UL_(0x4002c000)                              /**< \brief PDMIC0 Base Address */
#define PDMIC1_BASE_ADDRESS              _UL_(0x40030000)                              /**< \brief PDMIC1 Base Address */
#define PIOA_BASE_ADDRESS                _UL_(0x400e0e00)                              /**< \brief PIOA Base Address */
#define PIOB_BASE_ADDRESS                _UL_(0x400e1000)                              /**< \brief PIOB Base Address */
#define PMC_BASE_ADDRESS                 _UL_(0x400e0400)                              /**< \brief PMC Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x400e1400)                              /**< \brief RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x400e1460)                              /**< \brief RTC Base Address */
#define RTT_BASE_ADDRESS                 _UL_(0x400e1430)                              /**< \brief RTT Base Address */
#define SPI0_BASE_ADDRESS                _UL_(0x4000c400)                              /**< \brief SPI0 Base Address */
#define SPI1_BASE_ADDRESS                _UL_(0x40020400)                              /**< \brief SPI1 Base Address */
#define SPI2_BASE_ADDRESS                _UL_(0x40024400)                              /**< \brief SPI2 Base Address */
#define SPI3_BASE_ADDRESS                _UL_(0x40018400)                              /**< \brief SPI3 Base Address */
#define SPI4_BASE_ADDRESS                _UL_(0x4001c400)                              /**< \brief SPI4 Base Address */
#define SPI5_BASE_ADDRESS                _UL_(0x40008400)                              /**< \brief SPI5 Base Address */
#define SPI6_BASE_ADDRESS                _UL_(0x40040400)                              /**< \brief SPI6 Base Address */
#define SPI7_BASE_ADDRESS                _UL_(0x40034400)                              /**< \brief SPI7 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x400e1410)                              /**< \brief SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x40010000)                              /**< \brief TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x40014000)                              /**< \brief TC1 Base Address */
#define TWI0_BASE_ADDRESS                _UL_(0x4000c600)                              /**< \brief TWI0 Base Address */
#define TWI1_BASE_ADDRESS                _UL_(0x40020600)                              /**< \brief TWI1 Base Address */
#define TWI2_BASE_ADDRESS                _UL_(0x40024600)                              /**< \brief TWI2 Base Address */
#define TWI3_BASE_ADDRESS                _UL_(0x40018600)                              /**< \brief TWI3 Base Address */
#define TWI4_BASE_ADDRESS                _UL_(0x4001c600)                              /**< \brief TWI4 Base Address */
#define TWI5_BASE_ADDRESS                _UL_(0x40008600)                              /**< \brief TWI5 Base Address */
#define TWI6_BASE_ADDRESS                _UL_(0x40040600)                              /**< \brief TWI6 Base Address */
#define TWI7_BASE_ADDRESS                _UL_(0x40034600)                              /**< \brief TWI7 Base Address */
#define UDP_BASE_ADDRESS                 _UL_(0x40044000)                              /**< \brief UDP Base Address */
#define UHP_BASE_ADDRESS                 _UL_(0x4004c000)                              /**< \brief UHP Base Address */
#define USART0_BASE_ADDRESS              _UL_(0x4000c200)                              /**< \brief USART0 Base Address */
#define USART1_BASE_ADDRESS              _UL_(0x40020200)                              /**< \brief USART1 Base Address */
#define USART2_BASE_ADDRESS              _UL_(0x40024200)                              /**< \brief USART2 Base Address */
#define USART3_BASE_ADDRESS              _UL_(0x40018200)                              /**< \brief USART3 Base Address */
#define USART4_BASE_ADDRESS              _UL_(0x4001c200)                              /**< \brief USART4 Base Address */
#define USART5_BASE_ADDRESS              _UL_(0x40008200)                              /**< \brief USART5 Base Address */
#define USART6_BASE_ADDRESS              _UL_(0x40040200)                              /**< \brief USART6 Base Address */
#define USART7_BASE_ADDRESS              _UL_(0x40034200)                              /**< \brief USART7 Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x400e1450)                              /**< \brief WDT Base Address */
/** @}  end of Peripheral Base Address Definitions */

